#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    setlocale(LC_ALL, "RU");
//определение переменных
    float a, b, c, d;
//запрос ввода пользователя
    cout << "Введите a, b и c в формате 'a b c' для решения уравнения вида ax^2 + bx + c = 0: ";
    cin >> a >> b >> c;
//дискриминант уравнения
    d = (b * b) - (4 * a * c);
//решение неполного квадратного уравнения при a = 0
    if (a == 0) {
        //проверка Исключающая деление на 0
        if (b != 0) {
            //проВерка для предотврАщения вывода -0
            if (c == 0) { cout << "Для a = " << a << " для b = " << b << " и c = " << c << " x = " << 0 << endl; }
            else {
                cout << "Для a = " << a << " для b = " << b << " и c = " << c << " x = " << -c / b << endl;
            }
        }
        //проверка возможНых исходов при b=0
        else if (c != 0) {
            cout <<  "Для a = " << a << " для b = " << b << " и c = " << c << " корней нет" << endl;
        }
        else {
            cout << "Для a = " << a << " для b = " << b << " и c = " << c << " x - любое число" << endl;
        }
    }
//решение неполного квадратного уравнения при b = 0
    else if (b == 0) {
    //исключения варианта при котором будет браться корень из отрицательного числа
        if (( - c / a) < 0) {
            cout << "Для a = " << a << " для b = " << b << " и c = " << c << " корней нет" << endl;
        }
        else {
            //проверка для предотвращения вывода -0
            if (c == 0) { cout << "Для a = " << a << " для b = " << b << " и c = " << c << " x = " << 0 << endl; }
            else {
                cout << "Для a = " << a << " для b = " << b << " и c = " << c << " x1 = " << sqrt(-c / a) << " x2 = " << -sqrt(-c / a) << endl;
            }
        }
    }
//решение неполного квадратного уравнения при c = 0
    else if (c == 0) {
        cout << "Для a = " << a << " для b = " << b << " и c = " << c << " x1 = " << 0 << " x2 = " << -b/a << endl;
    }
//решение квадратного уравнения
    else{
        //если дискриминант > 0
        if (d > 0) {
            cout << "Для a = " << a << " для b = " << b << " и c = " << c << " x1 = " << ((-b) + sqrt(d)) / (2 * a) << " x2 = " << ((-b) - sqrt(d)) / (2 * a) << endl;
        }
        //если дискриминант = 0
        else if (d == 0) {
            cout << "Для a = " << a << " для b = " << b << " и c = " << c << " x = " << ((-b) + sqrt(d)) / (2 * a) << endl;
        }
        //если дискриминант < 0
        else {
            cout << "Для a = " << a << " для b = " << b << " и c = " << c << " корней нет" << endl;
        }
    }
}
